src/Documents/ПеремещениеВТорговыйЗалЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПеремещениеВТорговыйЗалЕГАИС</Name>
			<BasedOn>
				<xr:Item>Document.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС</xr:Item>
				<xr:Item>Document.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС</xr:Item>
				<xr:Item>Document.АктСписанияЕГАИС</xr:Item>
				<xr:Item>Document.ИнвентаризацияАлкогольнойПродукцииЕГАИС</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиАлкогольнойПродукцииЕГАИС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОрганизацияЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Comment>Регистрационный номер акта постановки на баланс</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.АктСписанияЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияАлкогольнойПродукцииЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АлкогольнаяПродукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Справка2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Марки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодМарки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиАлкогольнойПродукцииЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиАлкогольнойПродукцииЕГАИС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОрганизацияЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АлкогольнаяПродукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Справка2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерРегистра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиМарокЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиМарокЕГАИС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КодМарки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОрганизацияЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Справка2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Documents/ИнвентаризацияАлкогольнойПродукцииЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ИнвентаризацияАлкогольнойПродукцииЕГАИС</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОрганизацияЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.АктСписанияЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура (товар, услуга и т.п.)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьЕдиницаИзмерения</Name>
							<Comment>Единица измерения номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьКоэффициент</Name>
							<Comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АлкогольнаяПродукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика/серия номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Справка1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Справки1ЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Справка2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Comment>Фактическое количество товаров на складе</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКнижн</Name>
							<Comment>Расчетное (по базе данных) количество единиц измерения номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихКод</Name>
							<Comment>Штрихкод</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Марки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодМарки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ПеремещениеВТорговыйЗалЕГАИС/Ext/ObjectModule.bsl
// Модуль объекта документа "Акт списания ЕГАИС"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА


// Производит заполнение объекта на основании документа "Товарно-транспортная накладная ЕГАИС (входящая)".
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ТоварноТранспортнаяНакладнаяВходящаяЕГАИС(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения.
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПодчиненныеДокументы.Ссылка КАК Документ
	|ИЗ
	|	КритерийОтбора.ПодчиненныеДокументы(&Основание) КАК ПодчиненныеДокументы
	|ГДЕ
	|	ПодчиненныеДокументы.Ссылка ССЫЛКА Документ.ПеремещениеВТорговыйЗалЕГАИС";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Основание",ДанныеЗаполнения);
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Если Выборка.Количество() > 0 Тогда
		Товары.Очистить();
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='На основании документа <%1> уже введен <%2>.'"),ДанныеЗаполнения,Выборка[0].Документ);
		УправлениеДиалогомСервер.ЗапретитьОткрытиеФормыОбъекта(Выборка[0].Документ, ТекстСообщения);
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеВТорговыйЗалЕГАИС) КАК ХозОперация,
	|	ТоварноТранспортнаяНакладнаяЕГАИС.Грузополучатель КАК ОрганизацияЕГАИС,
	|	"""" КАК Идентификатор,
	|	"""" КАК РегистрационныйНомер,
	|	ДатаВремя(1,1,1) КАК ДатаРегистрации,
	|	&Ссылка КАК ДокументОснование
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС КАК ТоварноТранспортнаяНакладнаяЕГАИС
	|ГДЕ
	|	ТоварноТранспортнаяНакладнаяЕГАИС.Ссылка = &Ссылка
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварноТранспортнаяНакладнаяЕГАИСТовары.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	ТоварноТранспортнаяНакладнаяЕГАИСТовары.Справка2 КАК Справка2,
	|	ТоварноТранспортнаяНакладнаяЕГАИСТовары.КоличествоФакт КАК Количество,
	|	ТоварноТранспортнаяНакладнаяЕГАИСТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТоварноТранспортнаяНакладнаяЕГАИСТовары.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Товары КАК ТоварноТранспортнаяНакладнаяЕГАИСТовары
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Марки КАК ТоварноТранспортнаяНакладнаяЕГАИСМарки
	|ПО
	|	ТоварноТранспортнаяНакладнаяЕГАИСМарки.Ссылка = &Ссылка И 
	|	ТоварноТранспортнаяНакладнаяЕГАИСМарки.Ссылка = ТоварноТранспортнаяНакладнаяЕГАИСТовары.Ссылка И 
	|	ТоварноТранспортнаяНакладнаяЕГАИСМарки.ИдентификаторСтроки = ТоварноТранспортнаяНакладнаяЕГАИСТовары.ИдентификаторСтроки
	|ГДЕ
	|	ТоварноТранспортнаяНакладнаяЕГАИСТовары.Ссылка = &Ссылка И 
	|	ТоварноТранспортнаяНакладнаяЕГАИСМарки.ИдентификаторСтроки ЕСТЬ NULL И 
	|	ТоварноТранспортнаяНакладнаяЕГАИСТовары.КоличествоФакт > 0
	|УПОРЯДОЧИТЬ ПО
	|	ТоварноТранспортнаяНакладнаяЕГАИСТовары.НомерСтроки
	|";
	
	Товары.Очистить();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	// Возвращаем признак возможности дальнейшей обработки события.
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ТоварноТранспортнаяНакладнаяВходящаяЕГАИС()

// Производит заполнение объекта на основании документа "Товарно-транспортная накладная ЕГАИС (исходящая)".
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения.
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	//ТекстЗапроса = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ПодчиненныеДокументы.Ссылка КАК Документ
	//|ИЗ
	//|	КритерийОтбора.ПодчиненныеДокументы(&Основание) КАК ПодчиненныеДокументы
	//|ГДЕ
	//|	ПодчиненныеДокументы.Ссылка ССЫЛКА Документ.ПоступлениеТоваров";
	//
	//Запрос = Новый Запрос(ТекстЗапроса);
	//Запрос.УстановитьПараметр("Основание",ДанныеЗаполнения);
	//Выборка = Запрос.Выполнить().Выгрузить();
	//
	//Если Выборка.Количество() > 0 Тогда
	//	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='На основании документа <%1> уже введен <%2>.'"),ДанныеЗаполнения,Выборка[0].Документ);
	//	УправлениеДиалогомСервер.ЗапретитьОткрытиеФормыОбъекта(Выборка[0].Документ, ТекстСообщения);
	//	Возврат ЛОЖЬ;
	//КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеИзТорговогоЗалаЕГАИС) КАК ХозОперация,
	|	ТоварноТранспортнаяНакладнаяЕГАИС.Грузоотправитель КАК ОрганизацияЕГАИС,
	|	"""" КАК Идентификатор,
	|	"""" КАК РегистрационныйНомер,
	|	ДатаВремя(1,1,1) КАК ДатаРегистрации,
	|	&Ссылка КАК ДокументОснование
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС КАК ТоварноТранспортнаяНакладнаяЕГАИС
	|ГДЕ
	|	ТоварноТранспортнаяНакладнаяЕГАИС.Ссылка = &Ссылка
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	КонецЕсли;
	
	//Запрос.Текст = "ВЫБРАТЬ
	//|	ТоварноТранспортнаяНакладнаяЕГАИСТовары.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	//|	ТоварноТранспортнаяНакладнаяЕГАИСТовары.Справка2 КАК Справка2,
	//|	ТоварноТранспортнаяНакладнаяЕГАИСТовары.Количество КАК Количество,
	//|	ТоварноТранспортнаяНакладнаяЕГАИСТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	//|	ТоварноТранспортнаяНакладнаяЕГАИСТовары.НомерСтроки КАК НомерСтроки
	//|ИЗ
	//|	Документ.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Товары КАК ТоварноТранспортнаяНакладнаяЕГАИСТовары
	//|ГДЕ
	//|	ТоварноТранспортнаяНакладнаяЕГАИСТовары.Ссылка = &Ссылка
	//|УПОРЯДОЧИТЬ ПО
	//|	ТоварноТранспортнаяНакладнаяЕГАИСТовары.НомерСтроки
	//|";
	
	Запрос.УстановитьПараметр("ОрганизацияЕГАИС", ОрганизацияЕГАИС);
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТТНМарки.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ
	|	МаркированнаяПродукция
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Марки КАК ТТНМарки
	|ГДЕ
	|	ТТНМарки.Ссылка = &Ссылка
	|;
	|
	|ВЫБРАТЬ
	|	&ОрганизацияЕГАИС КАК ОрганизацияЕГАИС,
	|	ТТНТовары.АлкогольнаяПродукция,
	|	ТТНТовары.ИдентификаторСтроки,
	|	ТТНТовары.Справка2,
	|	СУММА(ТТНТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ
	|	ТТНТовары
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Товары КАК ТТНТовары
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	МаркированнаяПродукция КАК МаркированнаяПродукция
	|ПО
	|	ТТНТовары.ИдентификаторСтроки = МаркированнаяПродукция.ИдентификаторСтроки
	|ГДЕ
	|	ТТНТовары.Ссылка = &Ссылка И 
	|	МаркированнаяПродукция.ИдентификаторСтроки ЕСТЬ NULL И 
	|	(НЕ ТТНТовары.Справка2 = ЗНАЧЕНИЕ(Справочник.Справки2ЕГАИС.ПустаяСсылка))
	|СГРУППИРОВАТЬ ПО
	|	ТТНТовары.ИдентификаторСтроки,
	|	ТТНТовары.АлкогольнаяПродукция,
	|	ТТНТовары.Справка2
	|ИМЕЮЩИЕ
	|	СУММА(ТТНТовары.Количество)>0
	|;
	|
	|ВЫБРАТЬ
	|	ТТНТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТТНТовары.ОрганизацияЕГАИС КАК ОрганизацияЕГАИС,
	|	ТТНТовары.АлкогольнаяПродукция,
	|	ТТНТовары.Справка2 КАК Справка2,
	|	ТТНТовары.Количество-ЕСТЬNULL(ОстаткиАлкогольнойПродукцииЕГАИС.КоличествоОстаток, 0) КАК Количество
	|ИЗ
	|	ТТНТовары КАК ТТНТовары
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ОстаткиАлкогольнойПродукцииЕГАИС.Остатки(, (ОрганизацияЕГАИС, АлкогольнаяПродукция, Справка2) В (ВЫБРАТЬ ОрганизацияЕГАИС, АлкогольнаяПродукция, Справка2 ИЗ ТТНТовары)) КАК ОстаткиАлкогольнойПродукцииЕГАИС
	|ПО
	|	ТТНТовары.ОрганизацияЕГАИС = ОстаткиАлкогольнойПродукцииЕГАИС.ОрганизацияЕГАИС И 
	|	ТТНТовары.АлкогольнаяПродукция = ОстаткиАлкогольнойПродукцииЕГАИС.АлкогольнаяПродукция И 
	|	ТТНТовары.Справка2 = ОстаткиАлкогольнойПродукцииЕГАИС.Справка2
	|ГДЕ
	|	ТТНТовары.Количество > ЕСТЬNULL(ОстаткиАлкогольнойПродукцииЕГАИС.КоличествоОстаток, 0)
	|";
	
	Товары.Очистить();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	// Возвращаем признак возможности дальнейшей обработки события.
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС()

Функция ОбработкаЗаполнения_АктСписанияЕГАИС(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Если данные заполнения не указаны, значит производиться проверка существования обработчика заполнения у объекта.
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Если ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.АктСписанияСТорговогоЗалаЕГАИС Тогда
		ХозОперация = Справочники.ХозОперации.ПеремещениеВТорговыйЗалЕГАИС;
	Иначе
		ХозОперация = Справочники.ХозОперации.ПеремещениеИзТорговогоЗалаЕГАИС;
	КонецЕсли;
	
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_Документ_АктСписанияЕГАИС()

Функция ОбработкаЗаполнения_ИнвентаризацияАлкогольнойПродукцииЕГАИС(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Если данные заполнения не указаны, значит производиться проверка существования обработчика заполнения у объекта.
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	ХозОперация = Справочники.ХозОперации.ПеремещениеИзТорговогоЗалаЕГАИС;
	
	//перемещения из ТЗ Привязку марок - удалять марки проданные
	// перемещаем фактические марки из торгового зала с учетом проданных (наличии проданных)
	// затем привязка марок
	
	Товары.Очистить();
	Марки.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период",           ДанныеЗаполнения.Дата);
	Запрос.УстановитьПараметр("ОрганизацияЕГАИС", ОрганизацияЕГАИС);
	Запрос.УстановитьПараметр("Ссылка",           ДанныеЗаполнения);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаТовары.АлкогольнаяПродукция,
	|	&ОрганизацияЕГАИС КАК ОрганизацияЕГАИС,
	|	&Период КАК Период,
	|	ТаблицаМарки.КодМарки
	|ПОМЕСТИТЬ
	|	ТаблицаМарки
	|ИЗ
	|	Документ.ИнвентаризацияАлкогольнойПродукцииЕГАИС.Товары КАК ТаблицаТовары
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.ИнвентаризацияАлкогольнойПродукцииЕГАИС.Марки КАК ТаблицаМарки
	|ПО
	|	ТаблицаТовары.Ссылка = ТаблицаМарки.Ссылка И 
	|	ТаблицаТовары.ИдентификаторСтроки = ТаблицаМарки.ИдентификаторСтроки
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка И 
	|	ТаблицаТовары.Справка2 = ЗНАЧЕНИЕ(Справочник.Справки2ЕГАИС.ПустаяСсылка) И 
	|	(ВЫРАЗИТЬ(ТаблицаМарки.КодМарки КАК Строка(68)) = ТаблицаМарки.КодМарки)
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаМарки.АлкогольнаяПродукция,
	|	ТаблицаМарки.ОрганизацияЕГАИС,
	|	ТаблицаМарки.КодМарки
	|ПОМЕСТИТЬ
	|	ТаблицаНеПроданныеМарки
	|ИЗ
	|	ТаблицаМарки КАК ТаблицаМарки
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ОстаткиМарокЕГАИС КАК ОстаткиМарокЕГАИС
	|ПО
	|	ТаблицаМарки.КодМарки = ОстаткиМарокЕГАИС.КодМарки И 
	|	ТаблицаМарки.ОрганизацияЕГАИС = ОстаткиМарокЕГАИС.ОрганизацияЕГАИС И 
	|	ТаблицаМарки.Период < ОстаткиМарокЕГАИС.Период
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаМарки.АлкогольнаяПродукция,
	|	ТаблицаМарки.ОрганизацияЕГАИС,
	|	ТаблицаМарки.КодМарки
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|		КОГДА ОстаткиМарокЕГАИС.ВидДвижения ЕСТЬ NULL ТОГДА
	|			0
	|		КОГДА ОстаткиМарокЕГАИС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|			1
	|		ИНАЧЕ
	|			-1
	|	КОНЕЦ)>=0
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаМарки
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаМарки.ОрганизацияЕГАИС,
	|	ТаблицаМарки.АлкогольнаяПродукция,
	|	КОЛИЧЕСТВО(ТаблицаМарки.КодМарки) КАК Количество
	|ПОМЕСТИТЬ
	|	ОстаткиАлкогольнойПродукцииЕГАИС
	|ИЗ
	|	ТаблицаНеПроданныеМарки КАК ТаблицаМарки
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаМарки.ОрганизацияЕГАИС,
	|	ТаблицаМарки.АлкогольнаяПродукция
	|;
	|
	|ВЫБРАТЬ
	|	ОстаткиАлкогольнойПродукцииЕГАИС.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	ПеремещениеИзТЗ.Справка2 КАК Справка2,
	|	СУММА(ПеремещениеИзТЗ.Количество) КАК Количество
	|ПОМЕСТИТЬ
	|	ТаблицаПеремещенияИзТорговогоЗала
	|ИЗ
	|	ОстаткиАлкогольнойПродукцииЕГАИС КАК ОстаткиАлкогольнойПродукцииЕГАИС
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ОстаткиАлкогольнойПродукцииЕГАИС КАК ПеремещениеИзТЗ
	|ПО
	|	ОстаткиАлкогольнойПродукцииЕГАИС.АлкогольнаяПродукция = ПеремещениеИзТЗ.АлкогольнаяПродукция И 
	|	ОстаткиАлкогольнойПродукцииЕГАИС.ОрганизацияЕГАИС = ПеремещениеИзТЗ.ОрганизацияЕГАИС И 
	|	ПеремещениеИзТЗ.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеИзТорговогоЗалаЕГАИС) И 
	|	ПеремещениеИзТЗ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиАлкогольнойПродукцииЕГАИС.АлкогольнаяПродукция,
	|	ПеремещениеИзТЗ.Справка2
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаМарки.АлкогольнаяПродукция,
	|	ТаблицаМарки.КодМарки
	|ИЗ
	|	ТаблицаНеПроданныеМарки КАК ТаблицаМарки
	|;
	|
	|ВЫБРАТЬ
	|	ОстаткиАлкогольнойПродукцииЕГАИС.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	МАКСИМУМ(ОстаткиАлкогольнойПродукцииЕГАИС.Количество) КАК КоличествоОстаток,
	|	ПеремещениеВТЗ.Справка2,
	|	СУММА(ПеремещениеВТЗ.Количество)-ЕСТЬNULL(МАКСИМУМ(ПеремещениеИзТЗ.Количество), 0) КАК КоличествоВЗале,
	|	МАКСИМУМ(ПеремещениеВТЗ.Период) КАК Период
	|ИЗ
	|	ОстаткиАлкогольнойПродукцииЕГАИС КАК ОстаткиАлкогольнойПродукцииЕГАИС
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ОстаткиАлкогольнойПродукцииЕГАИС КАК ПеремещениеВТЗ
	|ПО
	|	ОстаткиАлкогольнойПродукцииЕГАИС.АлкогольнаяПродукция = ПеремещениеВТЗ.АлкогольнаяПродукция И 
	|	ОстаткиАлкогольнойПродукцииЕГАИС.ОрганизацияЕГАИС = ПеремещениеВТЗ.ОрганизацияЕГАИС И 
	|	ПеремещениеВТЗ.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеВТорговыйЗалЕГАИС) И 
	|	ПеремещениеВТЗ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ТаблицаПеремещенияИзТорговогоЗала КАК ПеремещениеИзТЗ
	|ПО
	|	ПеремещениеВТЗ.АлкогольнаяПродукция = ПеремещениеИзТЗ.АлкогольнаяПродукция И 
	|	ПеремещениеВТЗ.Справка2 = ПеремещениеИзТЗ.Справка2
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиАлкогольнойПродукцииЕГАИС.АлкогольнаяПродукция,
	|	ПеремещениеВТЗ.Справка2
	|ИМЕЮЩИЕ
	|	СУММА(ПеремещениеВТЗ.Количество)-ЕСТЬNULL(МАКСИМУМ(ПеремещениеИзТЗ.Количество), 0)>0
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ
	|ИТОГИ
	|	МАКСИМУМ(КоличествоОстаток)
	|ПО
	|	АлкогольнаяПродукция";
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	ТаблицаМарки = ПакетЗапросов[ПакетЗапросов.Количество()-2].Выгрузить();
	ТаблицаМарки.Индексы.Добавить("АлкогольнаяПродукция");
	
	Выборка = ПакетЗапросов[ПакетЗапросов.Количество()-1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		КоличествоОстаток  = Выборка.КоличествоОстаток;
		ВыборкаДетальныеЗаписи = Выборка.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если КоличествоОстаток<=0 Тогда
				Прервать;
			КонецЕсли;
			
			КоличествоВЗале = Мин(КоличествоОстаток, ВыборкаДетальныеЗаписи.КоличествоВЗале);
			
			Если КоличествоВЗале = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.АлкогольнаяПродукция = Выборка.АлкогольнаяПродукция;
			НоваяСтрока.Справка2             = ВыборкаДетальныеЗаписи.Справка2;
			НоваяСтрока.Количество           = КоличествоВЗале;
			НоваяСтрока.ИдентификаторСтроки  = Новый УникальныйИдентификатор;
			
			ОтборСтрок = Новый Структура;
			ОтборСтрок.Вставить("АлкогольнаяПродукция", Выборка.АлкогольнаяПродукция);
			
			НайденныеМарки = ТаблицаМарки.НайтиСтроки(ОтборСтрок);
			Счетчик = 0;
			Для Каждого ТекущаяМарка Из НайденныеМарки Цикл
				
				Если КоличествоВЗале = Счетчик Тогда
					Прервать;
				КонецЕсли;
				
				НоваяСтрокаМарки = Марки.Добавить();
				НоваяСтрокаМарки.КодМарки            = ТекущаяМарка.КодМарки;
				НоваяСтрокаМарки.ИдентификаторСтроки = НоваяСтрока.ИдентификаторСтроки;
				
				ТаблицаМарки.Удалить(ТекущаяМарка);
				
				Счетчик = Счетчик + 1;
				
			КонецЦикла;
			
			КоличествоОстаток = КоличествоОстаток - КоличествоВЗале;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если ТаблицаМарки.Количество()>=0 Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("РаспределенныеТовары",  Товары);
		Запрос.УстановитьПараметр("НеРаспределенныеМарки", ТаблицаМарки);
		Запрос.УстановитьПараметр("ОрганизацияЕГАИС",      ОрганизацияЕГАИС);
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ТаблицаМарки.АлкогольнаяПродукция,
		|	ТаблицаМарки.КодМарки
		|ПОМЕСТИТЬ
		|	НеРаспределенныеМарки
		|ИЗ
		|	&НеРаспределенныеМарки КАК ТаблицаМарки
		|;
		|
		|ВЫБРАТЬ
		|	ТаблицаМарки.АлкогольнаяПродукция,
		|	ТаблицаМарки.Справка2
		|ПОМЕСТИТЬ
		|	РаспределенныеТовары
		|ИЗ
		|	&РаспределенныеТовары КАК ТаблицаМарки
		|;
		|
		|ВЫБРАТЬ
		|	&ОрганизацияЕГАИС КАК ОрганизацияЕГАИС,
		|	ТаблицаМарки.АлкогольнаяПродукция,
		|	КОЛИЧЕСТВО(ТаблицаМарки.КодМарки) КАК Количество
		|ПОМЕСТИТЬ
		|	ОстаткиАлкогольнойПродукцииЕГАИС
		|ИЗ
		|	НеРаспределенныеМарки КАК ТаблицаМарки
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаМарки.АлкогольнаяПродукция
		|;
		//|
		//|ВЫБРАТЬ
		//|	ТаблицаМарки.АлкогольнаяПродукция,
		//|	ТаблицаМарки.КодМарки
		//|ИЗ
		//|	ТаблицаНеПроданныеМарки КАК ТаблицаМарки
		//|;
		|
		|ВЫБРАТЬ
		|	ОстаткиАлкогольнойПродукцииЕГАИС.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
		|	ОстаткиАлкогольнойПродукцииЕГАИС.Количество КАК КоличествоОстаток,
		|	Справки2.Ссылка КАК Справка2,
		|	Справки2.ДатаТТН КАК ДатаТТН,
		|	Справки2.Количество КАК КоличествоВЗале
		|ИЗ
		|	ОстаткиАлкогольнойПродукцииЕГАИС КАК ОстаткиАлкогольнойПродукцииЕГАИС
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	Справочник.Справки2ЕГАИС КАК Справки2
		|ПО
		|	Справки2.ПоштучныйУчет = ЛОЖЬ И 
		|	ОстаткиАлкогольнойПродукцииЕГАИС.АлкогольнаяПродукция = Справки2.АлкогольнаяПродукция И 
		|	ОстаткиАлкогольнойПродукцииЕГАИС.ОрганизацияЕГАИС = Справки2.Грузополучатель
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РаспределенныеТовары КАК РаспределенныеТовары
		|ПО
		|	Справки2.АлкогольнаяПродукция = РаспределенныеТовары.АлкогольнаяПродукция И 
		|	Справки2.Ссылка = РаспределенныеТовары.Справка2
		|ГДЕ
		|	Справки2.ПоштучныйУчет = ЛОЖЬ И 
		|	РаспределенныеТовары.Справка2 ЕСТЬ NULL И 
		|	Справки2.Количество > 0
		|УПОРЯДОЧИТЬ ПО
		|	ДатаТТН УБЫВ
		|ИТОГИ
		|	МАКСИМУМ(КоличествоОстаток)
		|ПО
		|	АлкогольнаяПродукция";
		
		Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выборка.Следующий() Цикл
			КоличествоОстаток  = Выборка.КоличествоОстаток;
			ВыборкаДетальныеЗаписи = Выборка.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Если КоличествоОстаток<=0 Тогда
					Прервать;
				КонецЕсли;
				
				КоличествоВЗале = Мин(КоличествоОстаток, ВыборкаДетальныеЗаписи.КоличествоВЗале);
				
				Если КоличествоВЗале = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.АлкогольнаяПродукция = Выборка.АлкогольнаяПродукция;
				НоваяСтрока.Справка2             = ВыборкаДетальныеЗаписи.Справка2;
				НоваяСтрока.Количество           = КоличествоВЗале;
				НоваяСтрока.ИдентификаторСтроки  = Новый УникальныйИдентификатор;
				
				ОтборСтрок = Новый Структура;
				ОтборСтрок.Вставить("АлкогольнаяПродукция", Выборка.АлкогольнаяПродукция);
				
				НайденныеМарки = ТаблицаМарки.НайтиСтроки(ОтборСтрок);
				Счетчик = 0;
				Для Каждого ТекущаяМарка Из НайденныеМарки Цикл
					
					Если КоличествоВЗале = Счетчик Тогда
						Прервать;
					КонецЕсли;
					
					НоваяСтрокаМарки = Марки.Добавить();
					НоваяСтрокаМарки.КодМарки            = ТекущаяМарка.КодМарки;
					НоваяСтрокаМарки.ИдентификаторСтроки = НоваяСтрока.ИдентификаторСтроки;
					
					ТаблицаМарки.Удалить(ТекущаяМарка);
					
					Счетчик = Счетчик + 1;
					
				КонецЦикла;
				
				КоличествоОстаток = КоличествоОстаток - КоличествоВЗале;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	КоличествоМарок = ТаблицаМарки.Количество()-1;
	Пока КоличествоМарок>=0 Цикл
		ТекущаяСтрока = ТаблицаМарки[КоличествоМарок];
		
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.АлкогольнаяПродукция = ТекущаяСтрока.АлкогольнаяПродукция;
		НоваяСтрока.ИдентификаторСтроки  = Новый УникальныйИдентификатор;
		
		ОтборСтрок = Новый Структура;
		ОтборСтрок.Вставить("АлкогольнаяПродукция", ТекущаяСтрока.АлкогольнаяПродукция);
		
		НайденныеМарки = ТаблицаМарки.НайтиСтроки(ОтборСтрок);
		
		НоваяСтрока.Количество = НайденныеМарки.Количество();
		
		Для Каждого ТекущаяМарка Из НайденныеМарки Цикл
			
			НоваяСтрокаМарки = Марки.Добавить();
			НоваяСтрокаМарки.КодМарки            = ТекущаяМарка.КодМарки;
			НоваяСтрокаМарки.ИдентификаторСтроки = НоваяСтрока.ИдентификаторСтроки;
			
			ТаблицаМарки.Удалить(ТекущаяМарка);
			
			КоличествоМарок = КоличествоМарок - 1;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_Документ_ИнвентаризацияАлкогольнойПродукцииЕГАИС()

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияЕГАИС.ОбработкаЗаполненияПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияЕГАИС.ОбработкаЗаполненияПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Идентификатор) Тогда
		Идентификатор = СокрЛП(Новый УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияЕГАИС.ЗаписатьСтатусДокументаЕГАИСПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	// Инициализация данных документа
	Документы.ПеремещениеВТорговыйЗалЕГАИС.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	РегистрыНакопления.ОстаткиАлкогольнойПродукцииЕГАИС.ЗаписатьТаблицуДвижений(ДополнительныеСвойства.ТаблицыДляДвижений.ОстаткиАлкогольнойПродукцииЕГАИС, Движения, Отказ);
	
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры // ОбработкаПроведения()


#КонецЕсли
